## Open API 활용
### Json파일 -> dict -> dataframe

### 데이터 변경

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./data/student.csv')
display(df)

    이름   학과   성적
0  아이유  국문학  3.0
1  김연아   수학  1.0
2  홍길동  컴퓨터  3.5
3  장범준   철학  2.7
4  강감찬  경영학  4.0

In [4]:
import os
os.getcwd()

'c:\\Users\\User\\aivle_school'

### 컬럼 생성

In [6]:
# 등급 컬럼 생성
df['등급'] = 'A'    # 새로운 컬럼 명시 후 값 부여
display(df)

    이름   학과   성적 등급
0  아이유  국문학  3.0  A
1  김연아   수학  1.0  A
2  홍길동  컴퓨터  3.5  A
3  장범준   철학  2.7  A
4  강감찬  경영학  4.0  A

In [7]:
# 성적에 따라 등급 부여
grade = np.array(['B', 'D', 'B', 'C', 'A'])
df['등급'] = grade
display(df)

    이름   학과   성적 등급
0  아이유  국문학  3.0  B
1  김연아   수학  1.0  D
2  홍길동  컴퓨터  3.5  B
3  장범준   철학  2.7  C
4  강감찬  경영학  4.0  A

In [9]:
# 나이를 의미하는 age라는 시리즈 생성
age = pd.Series([21,20,24,23,28])

# 데이터프레임내 나이 컬럼을 만들고 시리즈를 값으로 할당
df['나이'] = age

display(df)

    이름   학과   성적 등급  나이
0  아이유  국문학  3.0  B  21
1  김연아   수학  1.0  D  20
2  홍길동  컴퓨터  3.5  B  24
3  장범준   철학  2.7  C  23
4  강감찬  경영학  4.0  A  28

### 인덱스 설정 및 리셋

In [10]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
# 데이터프레임의 인덱스는 df.index를 명시하여 접근할 수 있음
df.index = ['one', 'two', 'three', 'four', 'five']  # 인덱스의 값을 바꾸고 싶으면 인덱스의 개수만큼의 원소를 포함한 리스트를 할당
df

        이름   학과   성적 등급  나이
one    아이유  국문학  3.0  B  21
two    김연아   수학  1.0  D  20
three  홍길동  컴퓨터  3.5  B  24
four   장범준   철학  2.7  C  23
five   강감찬  경영학  4.0  A  28

In [12]:
# 새로운 컬럼 성별 생성
sex = pd.Series(['여자', '여자', '남자', '남자', '남자'])
df['성별'] = sex
display(df)

        이름   학과   성적 등급  나이   성별
one    아이유  국문학  3.0  B  21  NaN
two    김연아   수학  1.0  D  20  NaN
three  홍길동  컴퓨터  3.5  B  24  NaN
four   장범준   철학  2.7  C  23  NaN
five   강감찬  경영학  4.0  A  28  NaN

In [ ]:
# sex 시리즈 인덱스 확인인
sex.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
# 시리즈 sex와 데이터프레임 df의 인덱스 출력
print('시리즈의 sex의 인덱스 ---> ', sex.index)
print('데이터프레임 df의 인덱스 ---> ', df.index)

시리즈의 sex의 인덱스 --->  RangeIndex(start=0, stop=5, step=1)
데이터프레임 df의 인덱스 --->  Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [15]:
# 인덱스 통일 후 다시 성별 컬럼에 값 부여
sex.index = df.indesx   # 성별 시리즈의 인덱스를 데이터프레임 인덱스로 변경
df['성별'] = sex
display(df)

AttributeError: 'DataFrame' object has no attribute 'indesx'